examples/cases/IDFF_Model/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 -0.004934 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 -0.1002680 0); //set the desired velocity
    }
    
    walls
    {
        type            noSlip;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    mem
    {
        type            noSlip;
    }
    
    currColl
    {
        type            noSlip;
    }
    
    front
    {
        type            empty;
    }  

    back
    {
        type            empty;
    } 
  
}


// ************************************************************************* //
