examples/cases/IDFF_Model/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Common parameters for all expressions
commonSettings
{
    // Corner points of the rectangular region for all expressions
    point1   (0 0 -0.017); // First corner point
    point2   (0.015 0.00044 0); // Opposite corner point
};

expressions
(
    porosity
    {
        field       porosity;
        dimensions  [0 0 0 0 0 0 0];

        constants
        {
            point1   $commonSettings.point1;
            point2   $commonSettings.point2;
            eps0     0.877;  // Lower porosity limit
            eps1     0.877;    // Upper porosity limit
        }

        variables
        (
            "x_min = min($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "x_max = max($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "y_min = min($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "y_max = max($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "z_min = min($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
            "z_max = max($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
        );

        fieldMask
        #{
            pos().x() >= x_min && pos().x() <= x_max &&
            pos().y() >= y_min && pos().y() <= y_max &&
            pos().z() >= z_min && pos().z() <= z_max
        #};

        expression
        #{
            (($[constants.eps1] - $[constants.eps0]) * (pos().y() - y_min) / (y_max - y_min)) + $[constants.eps0]
        #};
    }

    invPermeability
    {
        field       invPermeability;
        dimensions  [0 -2 0 0 0 0 0];

        constants
        {
            point1   $commonSettings.point1;
            point2   $commonSettings.point2;
            k0     9.18e10;  // Lower porosity limit
            k1     9.18e10;    // Upper porosity limit
        }

        variables
        (
            "x_min = min($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "x_max = max($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "y_min = min($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "y_max = max($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "z_min = min($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
            "z_max = max($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
        );

        fieldMask
        #{
            pos().x() >= x_min && pos().x() <= x_max &&
            pos().y() >= y_min && pos().y() <= y_max &&
            pos().z() >= z_min && pos().z() <= z_max
        #};

        expression
        #{
            (($[constants.k1] - $[constants.k0]) * (pos().y() - y_min) / (y_max - y_min)) + $[constants.k0]
        #};
    }

    kappa1
    {
        field       kappa1;
        dimensions  [-1 -3 3 0 0 2 0];

        constants
        {
            point1   $commonSettings.point1;
            point2   $commonSettings.point2;
            k0     275.78;  // Lower  limit
            k1     275.78;    // Upper  limit
        }

        variables
        (
            "x_min = min($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "x_max = max($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "y_min = min($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "y_max = max($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "z_min = min($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
            "z_max = max($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
        );

        fieldMask
        #{
            pos().x() >= x_min && pos().x() <= x_max &&
            pos().y() >= y_min && pos().y() <= y_max &&
            pos().z() >= z_min && pos().z() <= z_max
        #};

        expression
        #{
            (($[constants.k1] - $[constants.k0]) * (pos().y() - y_min) / (y_max - y_min)) + $[constants.k0]
        #};
    }

    areaPerVol
    {
        field       areaPerVol;
        dimensions  [0 -1 0 0 0 0 0];

        constants
        {
            point1   $commonSettings.point1;
            point2   $commonSettings.point2;
            k0     68010;  // Lower  limit
            k1     68010;    // Upper  limit
        }

        variables
        (
            "x_min = min($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "x_max = max($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "y_min = min($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "y_max = max($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "z_min = min($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
            "z_max = max($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
        );

        fieldMask
        #{
            pos().x() >= x_min && pos().x() <= x_max &&
            pos().y() >= y_min && pos().y() <= y_max &&
            pos().z() >= z_min && pos().z() <= z_max
        #};

        expression
        #{
            (($[constants.k1] - $[constants.k0]) * (pos().y() - y_min) / (y_max - y_min)) + $[constants.k0]
        #};
    }
    
    tau
    {
        field       tau;
        dimensions  [0 0 0 0 0 0 0];

        constants
        {
            point1   $commonSettings.point1;
            point2   $commonSettings.point2;
            k0     1.42;  // Lower  limit
            k1     1.42;    // Upper  limit
        }

        variables
        (
            "x_min = min($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "x_max = max($[(vector)constants.point1].x(), $[(vector)constants.point2].x())"
            "y_min = min($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "y_max = max($[(vector)constants.point1].y(), $[(vector)constants.point2].y())"
            "z_min = min($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
            "z_max = max($[(vector)constants.point1].z(), $[(vector)constants.point2].z())"
        );

        fieldMask
        #{
            pos().x() >= x_min && pos().x() <= x_max &&
            pos().y() >= y_min && pos().y() <= y_max &&
            pos().z() >= z_min && pos().z() <= z_max
        #};

        expression
        #{
            (($[constants.k1] - $[constants.k0]) * (pos().y() - y_min) / (y_max - y_min)) + $[constants.k0]
        #};
    }
);


// ************************************************************************* //
